In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../datasets/surveys.csv')
df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       34786 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB

In [4]:
df.shape

(35549, 9)

In [5]:
df.isnull().sum()

record_id             0
month                 0
day                   0
year                  0
plot_id               0
species_id          763
sex                2511
hindfoot_length    4111
weight             3266
dtype: int64

In [4]:
df.isnull()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,True
4,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...
35544,False,False,False,False,False,False,True,True,True
35545,False,False,False,False,False,False,True,True,True
35546,False,False,False,False,False,False,False,False,False
35547,False,False,False,False,False,False,False,False,False
35548,False,False,False,False,False,True,True,True,True

In [6]:
(df.isnull().sum()/df.shape[0])*100

record_id           0.000000
month               0.000000
day                 0.000000
year                0.000000
plot_id             0.000000
species_id          2.146333
sex                 7.063490
hindfoot_length    11.564320
weight              9.187319
dtype: float64

##### drop rows that have missing data

In [8]:
df_2 = df.dropna(how='any')
df_2.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
62,63,8,19,1977,3,DM,M,35.0,40.0
63,64,8,19,1977,7,DM,M,37.0,48.0
64,65,8,19,1977,4,DM,F,34.0,29.0
65,66,8,19,1977,4,DM,F,35.0,46.0
66,67,8,19,1977,7,DM,M,35.0,36.0

In [9]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30676 entries, 62 to 35547
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        30676 non-null  int64
 1   month            30676 non-null  int64
 2   day              30676 non-null  int64
 3   year             30676 non-null  int64
 4   plot_id          30676 non-null  int64
 5   species_id       30676 non-null  object
 6   sex              30676 non-null  object
 7   hindfoot_length  30676 non-null  float64
 8   weight           30676 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.3+ MB

In [9]:
df_3 = df.dropna(how='all', subset=['weight', 'hindfoot_length'])
df_3.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [10]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32983 entries, 0 to 35547
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        32983 non-null  int64
 1   month            32983 non-null  int64
 2   day              32983 non-null  int64
 3   year             32983 non-null  int64
 4   plot_id          32983 non-null  int64
 5   species_id       32983 non-null  object
 6   sex              32876 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.5+ MB

 Keep only the rows with at least 7 non-NA values.

In [59]:
df_3_1 = df.dropna(how='all', thresh=7)
df_3_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33145 entries, 0 to 35547
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        33145 non-null  int64
 1   month            33145 non-null  int64
 2   day              33145 non-null  int64
 3   year             33145 non-null  int64
 4   plot_id          33145 non-null  int64
 5   species_id       33145 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.5+ MB

In [60]:
df_3_2 = df.dropna(thresh=2, subset=['weight', 'hindfoot_length'])
df_3_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30738 entries, 62 to 35547
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        30738 non-null  int64
 1   month            30738 non-null  int64
 2   day              30738 non-null  int64
 3   year             30738 non-null  int64
 4   plot_id          30738 non-null  int64
 5   species_id       30738 non-null  object
 6   sex              30676 non-null  object
 7   hindfoot_length  30738 non-null  float64
 8   weight           30738 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.3+ MB

In [11]:
df1 = pd.DataFrame(np.arange(15).reshape(5,3))
df1.iloc[:4,1] = np.nan
df1.iloc[:2,2] = np.nan
df1

    0     1     2
0   0   NaN   NaN
1   3   NaN   NaN
2   6   NaN   8.0
3   9   NaN  11.0
4  12  13.0  14.0

In [63]:
df1.dropna(thresh=1 ,axis=1)

    0     1     2
0   0   NaN   NaN
1   3   NaN   NaN
2   6   NaN   8.0
3   9   NaN  11.0
4  12  13.0  14.0

In [64]:
df1.dropna(thresh=2 ,axis=1)

    0     2
0   0   NaN
1   3   NaN
2   6   8.0
3   9  11.0
4  12  14.0

In [65]:
df1.dropna(thresh=3 ,axis=1)

    0     2
0   0   NaN
1   3   NaN
2   6   8.0
3   9  11.0
4  12  14.0

In [66]:
df1.dropna(thresh=4 ,axis=1)

    0
0   0
1   3
2   6
3   9
4  12

In [72]:
df1

    0     1     2
0   0   NaN   NaN
1   3   NaN   NaN
2   6   NaN   8.0
3   9   NaN  11.0
4  12  13.0  14.0

In [73]:
df1.dropna(thresh=1 )

    0     1     2
0   0   NaN   NaN
1   3   NaN   NaN
2   6   NaN   8.0
3   9   NaN  11.0
4  12  13.0  14.0

In [74]:
df1.dropna(thresh=2 )

    0     1     2
2   6   NaN   8.0
3   9   NaN  11.0
4  12  13.0  14.0

In [75]:
df1.dropna(thresh=3 )

    0     1     2
4  12  13.0  14.0

In [76]:
df1.dropna(thresh=4 )

Empty DataFrame
Columns: [0, 1, 2]
Index: []

## fill-in missing data

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       34786 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB

In [14]:
df_4 = df.fillna(value='0')
df_4

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,0
1,2,7,16,1977,3,NL,M,33.0,0
2,3,7,16,1977,2,DM,F,37.0,0
3,4,7,16,1977,7,DM,M,36.0,0
4,5,7,16,1977,3,DM,M,35.0,0
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,0,0,0
35545,35546,12,31,2002,15,AH,0,0,0
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,0,0,0,0

#### what happened seems not the best for categorical fields!

In [15]:
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       35549 non-null  object
 6   sex              35549 non-null  object
 7   hindfoot_length  35549 non-null  object
 8   weight           35549 non-null  object
dtypes: int64(5), object(4)
memory usage: 2.4+ MB

In [80]:
df['sex'].mode()

0    M
dtype: object

In [19]:
df['sex'].mode()[0]
df['hindfoot_length'].mean()

29.287931802277498

In [16]:
filling_values = {"weight": 0, "hindfoot_length": df['hindfoot_length'].mean(), "sex": df['sex'].mode().iloc[0], "species_id": df['species_id'].mode().iloc[0]}
df_5 = df.fillna(value=filling_values)
df_5

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.000000,0.0
1,2,7,16,1977,3,NL,M,33.000000,0.0
2,3,7,16,1977,2,DM,F,37.000000,0.0
3,4,7,16,1977,7,DM,M,36.000000,0.0
4,5,7,16,1977,3,DM,M,35.000000,0.0
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,M,29.287932,0.0
35545,35546,12,31,2002,15,AH,M,29.287932,0.0
35546,35547,12,31,2002,10,RM,F,15.000000,14.0
35547,35548,12,31,2002,7,DO,M,36.000000,51.0
35548,35549,12,31,2002,5,DM,M,29.287932,0.0

#### Now, I'm more staified

In [17]:
df_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       35549 non-null  object
 6   sex              35549 non-null  object
 7   hindfoot_length  35549 non-null  float64
 8   weight           35549 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB

In [84]:
df_5.to_csv("../datasets/surveys_2.csv", index=None)